# WorksetConfiguration Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WorksetConfiguration Methods
WorksetConfiguration Class See Also
---
The WorksetConfiguration type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Close | Sets a group of user-created worksets to close. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| Open | Sets a group of user-created worksets to open. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
WorksetConfiguration Class
Autodesk.Revit.DB Namespace